MyTTF_rails_backend/app/controllers/api/matches_controller.rb

SELECT "matches".* FROM "matches"
---
    def index
        matches = Match.all

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        match = Match.find_by(:id => params[:id])

INSERT INTO "matches" ("player_id", "created_at", "updated_at", "date", "notes", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["player_id", 1], ["created_at", "2019-11-07 06:28:02.181199"], ["updated_at", "2019-11-07 06:28:02.181199"], ["date", "2019-11-07"], ["notes", "Here we go."], ["title", "Trying this again."]]
---
    def create
        match = Match.create(match_params)

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "matches" SET "notes" = $1, "title" = $2, "date" = $3, "updated_at" = $4 WHERE "matches"."id" = $5  [["notes", "Edited notes here."], ["title", "This is an edit."], ["date", "2019-11-10"], ["updated_at", "2019-11-10 23:01:08.927256"], ["id", 31]]
---
    def update
        match = Match.find_by(:id => params[:id])
        # byebug
        # Need to have :id passed in via
        match.update(match_params)

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 34]]
---
    def destroy
        match = Match.find_by(:id => params[:id])
        match.destroy