MyTTF_rails_backend/app/controllers/api/players_controller.rb

    def index
        players = Player.all
---
SELECT "players".* FROM "players"

    def show
        player = Player.find_by(:id => params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]